{
  "basics": {
      "name": "Patrick Musau",
      "label": "Third year PhD Student working on problems related to the safety and reliability of systems that make use of Artificial Intelligence (AI) and Machine Learning (ML). Drawing on techniques and tools from formal methods, the goal of my research is to develop techniques that provide rigorous guarantees that that these systems are trustworthy. I'm also interested in the commercialization of these technologies. In order to maximize the benefit of these methods, I'm exploring translating these ideas from the lab to the marketplace by participating in entrepreneurial programs at Vanderbilt.",
      "location": {
          "address": "1025 16th Ave S, Suite 102",
          "postalCode": "TN 37212",
          "city": "Nashville",
          "countryCode": "US",
          "region": "Tennessee"
        },
        "profiles": [
          {
            "network": "Twitter",
            "username": "pmusau13",
            "url": "https://twitter.com/pmusau13"
          },
          {
            "network": "LinkedIn",
            "username": "patrick-musau",
            "url": "https://www.linkedin.com/in/musaup/"
          }
        ]
      },
  "work": [
      {
          "company": "Vanderbilt Institute of Software Integrated Systems",
          "position": "Graduate Research Assistant",
          "website": "https://www.isis.vanderbilt.edu/",
          "startDate": "2017-07-01",
          "endDate": "",
          "summary": "Research is primarily focused on the verification of artificial neural networks and AI inspired autonomous applications",
          "highlights": [
            "Developing a translation tool for neural network models into the Open Neural Network Exchange format (https://onnx.ai/) to assist verification researchers in translating between the various input formats for state of the art neural network verification tools.",
            "Involved in DARPA’s Assured Autonomy project, that seeks to assure Learning enabled components in Autonomous Cyber-physical systems",
            "Participant in the F1Tenth Autonomous Racing Competition (f1tenth.org). Competed at CPS IOT Week in Montreal, Canada in April of 2019 and Columbia University in October 2019",
            "Participated in the 2018 and 2019 edition of the NSF CPS Challenge focused on autonomous drone applications"
    
          ]
        },
      {
          "company": "Furman University",
          "summary": "Under the supervision of Dr. Berhane Temelso and Dr. George Shields and Furman University's Chemistry Department I created a web application that stored highly detailed quantum mechanical calculations of molecular cluster energies and geometry calculations. The system was modeled after The Benchmark Energy and Geometry Database (begdb.com). The system we built sought to  promote the efficient storing and access of molecular cluster data and allow computational chemists to contribute benchmark data and promote collaboration. The tools that we used to create the system include HTML, SQL, PHP, AJAX, JavaScript, Bootstrap, JQuery, and JSmol.",
          "position": "Furman University Chemistry Department Research Fellow",
          "startDate": "2017-05-01",
          "endDate": "2017-05-01"
      },
      {
          "company": "Furman University",
          "summary": "Under the supervision of Dr. Andrea Tartaro, \n♣\tDesigned a web-based dietary self-monitoring application modeled after the United States Department of Agriculture’s MyPlate food recommendations and guidelines for use in a long-term study to analyze the effectiveness and usability of such a system in facilitating weight loss. \n♣\tCreated a PHP based user authentication system based on secure hashing algorithms and security certificates provided by Furman University’s IT department\n♣\tCreated user friendly dietary tracking pages for users in the control and focus groups\n♣\tWrote PHP scripts for the efficient storing and retrieval of information in the SMI database \nDesigned webpages to give study participants feedback on their dietary meal compositions using JavaScript, JQuery, Bootstrap, CanvasJS, and HighCharts",
          "position": "Undergraduate Research Fellow",
          "startDate": "2016-05-01",
          "endDate": "2016-12-01"
      },
      {
          "company": "Furman University",
          "summary": "Under the supervision of Furman University’s Housing and Residence life department, my role was to serve as a role model for new students and mentor them in areas, which encouraged and supported academic success. Additionally, it was my responsibility to serve as a liaison between students and institutional academic resources.",
          "position": "Freshman Advisor",
          "startDate": "2014-08-01",
          "endDate": "2016-08-01"
      }
  ],
  "education": [
      {
          "institution": "Vanderbilt University",
          "area": "Electrical Engineering",
          "studyType": "Doctor of Philosophy",
          "startDate": "2017-07-01",
          "endDate": "2022-05 (Expected)",
          "gpa": "3.9",
          "courses": [
            "CS-5260 - Artificial Intelligence",
            "CS-5891 - Resilient Distributed Computing",
            "CS-8395 - Machine Learning Verification"
          ]
        },
      {
          "institution": "Furman University",
          "area": "Physics and Computing Applied Math",
          "studyType": "Bachelor of Science (BS) Summa Cum Laude",
          "gpa": "GPA: 3.991",
          "startDate": "2013-01-01",
          "endDate": "2017-01-01"
      }
  ],
  "awards": [
      {
          "title": "Wond’ry Prelaunch Entrepreneur Program - Microgrant Winner",
          "date": "2019-11-13",
          "awarder": "The Wond'ry",
          "summary": "$2300 Towards Customer Discovery"
      },
      {
          "title": "Computer Science-Mathematics Award for Excellence",
          "awarder": "Furman University Department of Computer Science and Furman University Department of Mathematics",
          "summary": "Presented by the combined faculties of Computer Science and Mathematics to the student with the highest grade point average in the Computing and Applied Mathematics major.",
          "date": "2017-04-01"
      },
      {
          "title": "Member of Pi Mu Epsilon",
          "awarder": "South Carolina Delta Chapter of Pi Mu Epsilon",
          "summary": "Pi Mu Epsilon is a national mathematics honorary society for undergraduates  in recognition of an excellent academic record in general and superior performance in mathematics",
          "date": "2017-04-01"
      },
      {
          "title": "Member of Quaternion Club",
          "awarder": "Quaternion Club",
          "summary": "The Quaternion Club is Furman University's elite men\'s honor society founded in 1903  that selects  4 men from the junior class and 4 from the senior class at Furman University each year who have exemplified  outstanding leadership, scholarship, service and moral integrity in their undergraduate career.\nhttps:\/\/news.furman.edu\/2017\/03\/27\/an-honor-of-the-highest-accord\/",
          "date": "2017-03-01"
      },
      {
          "title": "Member of Upsilon Pi Epsilon",
          "awarder": "Upsilon Pi Epsilon Chapter of Furman University",
          "summary": "Upsilon Pi Epsilon recognizes academic excellence at both the undergraduate and graduate levels in the Computing and Information Disciplines.",
          "date": "2017-02-01"
      },
      {
          "title": "Member of Phi Beta Kappa",
          "summary": "Phi Beta Kappa is the most prestigious academic honor society in the United States seeking to celebrate excellence in the liberal arts and sciences and to champion freedom of thought",
          "date": "2016-04-01"
      },
      {
          "title": "Member of Sigma Pi Sigma",
          "summary": "Sigma Pi Sigma seeks to honor outstanding scholarship in physics, promote an attitude of service, and to provide a fellowship of persons who have excelled in physics.",
          "date": "2016-04-01"
      },
      {
          "title": "Goodwill Scholars Scholarship",
          "awarder": "Furman University",
          "date": "2013-07-01"
      }
  ],
  "publications": [
      {
          "name": "Decentralized Real-Time Safety Verification for Distributed Cyber-Physical Systems",
          "publisher": "Springer International Publishing",
          "website": "http:\/\/www.taylortjohnson.com\/research\/tran2019forte.pdf",
          "summary": "Safety-critical distributed cyber-physical systems (CPSs) have been found in a wide range of applications. Notably, they have displayed a great deal of utility in intelligent transportation, where autonomous vehicles communicate and cooperate with each other via a high-speed communication network. Such systems require an ability to identify maneuvers in real-time that cause dangerous circumstances and ensure the implementation always meets safety-critical requirements. In this paper, we propose a real-time decentralized safety verification approach for a distributed multi-agent CPS with the underlying assumption that all agents are time-synchronized with a low degree of error. In the proposed approach, each agent periodically computes its local reachable set and exchanges this reachable set with the other agents with the goal of verifying the system safety. Our method, implemented in Java, takes advantages of the timing information and the reachable set information that are available in the exchanged messages to reason about the safety of the whole system in a decentralized manner. Any particular agent can also perform local safety verification tasks based on their local clocks by analyzing the messages it receives. We applied the proposed method to verify, in real-time, the safety properties of a group of quadcopters performing a distributed search mission.",
          "releaseDate": "2019-06-01"
      },
      {
          "name": "Star-Based Reachability Analsysis for Deep Neural Networks",
          "publisher": "Springer International Publishing",
          "website": "http:\/\/www.taylortjohnson.com\/research\/tran2019fm.pdf",
          "summary": "This paper proposes novel reachability algorithms for both exact (sound and complete) and over-approximation (sound) analysis for deep neural networks (DNNs). The approach uses star sets as a symbolic representation of sets of states, which are known in short as stars and provide an effective representation of high-dimensional polytopes. Our star-based reachability algorithms can be applied to several problems in analyzing the robustness of machine learning methods, such as safety and robustness verification of DNNs. Our star-based reachability algorithms are implemented in a software prototype called the neural network verification (NNV) tool that is publicly available for evaluation and\ncomparison. Our experiments show that when verifying ACAS Xu neural networks on a multi-core platform, our exact reachability algorithm is on average about 19 times faster than Reluplex, a satisfiability modulo theory (SMT)-based approach. Furthermore, our approach can visualize the precise behavior of DNNs because the reachable states are computed in the method. Notably, in the case that a DNN violates a safety property, the exact reachability algorithm can construct a complete set of counterexamples. Our star-based over-approximate reachability algorithm is on average 118 times faster than Reluplex on the verification of properties for ACAS Xu networks, even without exploiting the parallelism that comes naturally in our method. Additionally, our over-approximate reachability is much less conservative than DeepZ and DeepPoly, recent approaches utilizing zonotopes and other abstract domains that fail to verify many properties of ACAS Xu networks due to their conservativeness. Moreover, our star-based over-approximate reachability algorithm obtains better robustness bounds in comparison with DeepZ and DeepPoly when verifying the robustness of image classification DNNs.",
          "releaseDate": "2019-06-01"
      },
      {
          "name": "Parallelizable Reachability Analysis Algorithms for Feed-forward Neural Networks",
          "publisher": "IEEE Press",
          "website": "https:\/\/2019.icse-conferences.org\/details\/Formalise-2019-papers\/6\/Parallelizable-Reachability-Analysis-Algorithms-for-Feed-Forward-Neural-Networks",
          "summary": "Artificial neural networks (ANN) have displayed considerable utility in a wide range of applications such as image processing, character and pattern recognition, self-driving cars, evolutionary robotics, and non-linear system identification and control. While ANNs are able to carry out complicated tasks efficiently, they are susceptible to unpredictable and errant behavior due to irregularities that emanate from their complex non-linear structure. As a result, there have been reservations about incorporating them into safety-critical systems. In this paper, we propose a reachability analysis method for feed- forward neural networks (FNN) that employ rectified linear units (ReLUs) as activation functions. The crux of our approach relies on three reachable-set computation algorithms, namely exact schemes, lazy-approximate schemes, and mixing schemes. The exact scheme computes an exact reachable set for an FNN, while the lazy-approximate and mixing schemes generate an over-approximation of the exact reachable set. All schemes are designed efficiently to run on parallel platforms to reduce the computation time and enhance the scalability. Our methods are implemented in a MATLAB toolbox called, NNV, and is evaluated using a set of benchmarks that consist of realistic neural networks with sizes that range from tens to a thousand neurons. Notably, NNV successfully computes and visualizes the exact reachable sets represented as a union of tens to hundreds of polyhedra, of the real-world ACAS Xu deep neural networks (DNNs) in the new generation of Airborne Collision Avoidance System X.",
          "releaseDate": "2019-05-01"
      },
      {
          "name": "Verification of Closed-loop Systems with Neural Network Controllers",
          "publisher": "EasyChair",
          "website": "https:\/\/easychair.org\/publications\/paper\/ZmnC",
          "summary": "This benchmark suite presents a detailed description of a series of closed-loop control systems with artificial neural network controllers. In many applications, feed-forward neural networks are heavily involved in the implementation of controllers by learning and representing control laws through several methods such as model predictive control (MPC) and reinforcement learning (RL). The type of networks that we consider in this manuscript are feed-forward neural networks consisting of multiple hidden layers with ReLU activation functions and a linear activation function in the output layer. While neural network con- trollers have been able to achieve desirable performance in many contexts, they also present a unique challenge in that it is difficult to provide any guarantees about the correctness of their behavior or reason about the stability a system that employs their use. Thus, from a controls perspective, it is necessary to verify them in conjunction with their corresponding plants in closed-loop. While there have been a handful of works proposed towards the verification of closed-loop systems with feed-forward neural network controllers, this area still lacks attention and a unified set of benchmark examples on which verification techniques can be evaluated and compared. Thus, to this end, we present a range of closed-loop control systems ranging from two to six state variables, and a range of controllers with sizes in the range of eleven neurons to a few hundred neurons in more complex systems.",
          "releaseDate": "2019-04-01"
      },
      {
          "name": "ARCH-COMP19 Category Report: Artificial Intelligence and Neural Network Control Systems (AINNCS) for Continuous and Hybrid Systems Plants",
          "publisher": "EasyChair",
          "website": "https:\/\/easychair.org\/publications\/paper\/BFKs",
          "summary": "This report presents the results of a friendly competition for formal verification of continuous and hybrid systems with artificial intelligence (AI) components. Specifically, machine learning (ML) components in cyber-physical systems (CPS), such as feedforward neural networks used as feedback controllers in closed-loop systems are considered, which is a class of systems classically known as intelligent control systems, or in more modern and specific terms, neural network control systems (NNCS). For future iterations, we more broadly refer to this category as AI and NNCS (AINNCS). The friendly competition took place as part of the workshop Applied Verification for Continuous and Hybrid Systems (ARCH) in 2019. In the first edition of this AINNCS category at ARCH-COMP, three tools have been applied to solve five different benchmark problems, (in alphabetical order): NNV, Sherlock, and Verisig. This report is a snapshot of the current landscape of tools and the types of benchmarks for which these tools are suited. Due to the diversity of problems and that this is the first iteration of this category, we are not ranking tools in terms of performance, yet the presented results probably provide the most complete assessment of tools for the safety verification of NNCS.",
          "releaseDate": "2019-04-01"
      },
      {
          "name": "Safety Verification of Cyber-Physical Systems with Reinforcement Learning Control",
          "publisher": "publication descriptionACM SIGBED International Conference on Embedded Software (EMSOFT'19), ACM",
          "website": "http:\/\/www.taylortjohnson.com\/research\/tran2019emsoft.pdf",
          "summary": "This paper proposes a new forward reachability analysis approach to verify the safety of cyber-physical systems (CPS) with reinforcement learning controllers. The foundation of our approach lies on two efficient, exact and over-approximate reachability algorithms for neural network control systems using star set which is an efficient representation of polyhedron. Using these algorithms, we determine the initial conditions for which a safety-critical system with a neural network controller is safe by incrementally searching a critical initial condition where the safety of the system cannot be proved. Our approach produces tight over-approximation error and it is computational efficient which allows the application to practical CPS with learning enable components (LECs). We implement our approach in NNV [18], a recent verification tool for neural network control systems, and evaluate its advantages and\napplicability by verifying the safety of a practical Advanced Emergency Braking System (AEBS) with a reinforcement learning (RL) controller trained using deep deterministic policy gradient (DDPG)\nmethod. The experimental results show that our new reachability algorithms are much less conservative than the polyhedron-based approach [18, 21, 22]. We successfully determine the entire region of the initial conditions of the AEBS with the RL controller such that the safety of the system is guaranteed while the polyhedron-based approach cannot prove the safety properties of the system.",
          "releaseDate": "2019-01-01"
      },
      {
          "name": "Verification for Machine Learning, Autonomy, and Neural Networks Survey",
          "publisher": "arXiv e-Print Archive",
          "website": "https:\/\/arxiv.org\/abs\/1810.01989",
          "summary": "This survey presents an overview of verification techniques for autonomous systems, with a focus on safety-critical autonomous cyber-physical systems (CPS) and subcomponents thereof. Autonomy in CPS is enabling by recent advances in artificial intelligence (AI) and machine learning (ML) through approaches such as deep neural networks (DNNs), embedded in so-called learning enabled components (LECs) that accomplish tasks from classification to control. Recently, the formal methods and formal verification community has developed methods to characterize behaviors in these LECs with eventual goals of formally verifying specifications for LECs, and this article presents a survey of many of these recent approaches.",
          "releaseDate": "2018-10-04"
      },
      {
          "name": "Verification of Continuous Time Recurrent Neural Networks (Benchmark Proposal)",
          "publisher": "Easy Chair",
          "website": "https:\/\/easychair.org\/publications\/paper\/K6SZ",
          "summary": "This manuscript presents a description and implementation of two benchmark problems for continuous-time recurrent neural network (RNN) verification. The first problem deals with the approximation of a vector field for a fixed point attractor located at the origin, whereas the second problem deals with the system identification of a forced damped pendulum. While the verification of neural networks is complicated and often impenetrable to the majority of verification techniques, continuous-time RNNs represent a class of networks that may be accessible to reachability methods for nonlinear ordinary differential equations (ODEs) derived originally in biology and neuroscience. Thus, an understanding of the behavior of a RNN may be gained by simulating the nonlinear equations from a diverse set of initial conditions and inputs, or considering reachability analysis from a set of initial conditions. The verification of continuous-time RNNs is a research area that has received little attention and if the research community can achieve meaningful results in this domain, then this class of neural networks may prove to be a superior approach in solving complex problems compared to other network architectures.",
          "releaseDate": "2018-09-17"
      },
      {
          "name": "Linear Differential-Algebraic Equations (Benchmark Proposal)",
          "publisher": "EasyChair",
          "website": "https:\/\/easychair.org\/publications\/paper\/mc5T",
          "summary": "This benchmark suite consists of eight small-to-large scale index-1 to index-3 linear differential algebraic systems (DAEs) derived from various application domains in engineering and science that exemplify the systemic prevalence of DAE systems in cyber-physical system applications. While in the last two decades numerous verification approaches and tools have been developed for systems described by ordinary differential equations, there is currently a lack of research methods for differential algebraic equations. Thus, the verification of DAE systems remains an open problem that has not been adequately addressed in the research literature. The following paper seeks to address this shortcoming by presenting a series of benchmark problems to stimulate the development of efficient and scalable tools for DAE verification and falsification. The benchmark models presented in this manuscript are available in the SpaceEx format using a tool named Daev for model generation.",
          "releaseDate": "2018-09-17"
      },
      {
          "name": "Reachable Set Estimation and Verification for Neural Network Models of Nonlinear Dynamic Systems",
          "publisher": "Springer",
          "website": "http:\/\/www.taylortjohnson.com\/research\/xiang2018ust.pdf",
          "summary": "Neural networks have been widely used to solve complex\nreal-world problems. Due to the complex, nonlinear, non-convex nature\nof neural networks, formal safety and robustness guarantees for the behaviors\nof neural network systems are crucial for their applications in\nsafety-critical systems. In this paper, the reachable set estimation and\nsafety verification problems for Nonlinear Autoregressive-Moving Average\n(NARMA) models in the forms of neural networks are addressed.\nThe neural networks involved in the model are a class of feed-forward\nneural networks called Multi-Layer Perceptrons (MLPs). By partitioning\nthe input set of an MLP into a finite number of cells, a layer-by-layer\ncomputation algorithm is developed for reachable set estimation of each\nindividual cell. The union of estimated reachable sets of all cells forms\nan over-approximation of the reachable set of the MLP. Furthermore,\nan iterative reachable set estimation algorithm based on reachable set\nestimation for MLPs is developed for NARMA models. The safety verification\ncan be performed by checking the existence of non-empty intersections\nbetween unsafe regions and the estimated reachable set. Several\nnumerical examples are provided to illustrate the approach",
          "releaseDate": "2018-09-01"
      }
  ],
  "skills": [
      {
          "name": "Python (Proficient)"
      },
      {
          "name": "SQL (Intermediate)"
      },
   
      {
          "name": "OpenCV"
      },
      {
          "name": "Artificial Neural Networks"
      },
      {
          "name": "Docker"
      },
      {
          "name": "Robot Operating System (ROS)"
      },
      {
          "name": "Linux"
      }
  ],
  "languages": [
      {
          "language": "English",
          "fluency": "Native speaker"
        },
        {
          "language": "French",
          "fluency": "Intermediate"
        },
        {
          "language": "Swahili",
          "fluency": "Intermediate"
        }
  ],
  "interests": [
      {
        "name": "AI Safety",
        "keywords": [
          "Formal Methods",
          "Verification",
          "Fault-tolerance",
          "Robust Deep Learning"
        ]  
      },
      {
        "name": "Cyber-Physical Systems",
        "keywords": [
          "Robotics",
          "Intelligent Control",
          "Distributed Computing"
        ]  
      }
    ]   
}
